Repository: zyk1172/Auralis
Catalog: Packages/AuralisCore/Sources/OpenSubsonicKit/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: OpenSubsonic 参数无效：\(name)
en: Invalid OpenSubsonic parameter: \(name)
zh_hant: OpenSubsonic 參數無效：\(name)

source: OpenSubsonic 参数无效：%@
en: Invalid OpenSubsonic parameter: %@
zh_hant: OpenSubsonic 參數無效：%@

source: OpenSubsonic 响应缺少 \(name)。
en: The OpenSubsonic response did not contain \(name).
zh_hant: OpenSubsonic 響應缺少 \(name)。

source: OpenSubsonic 响应缺少 %@。
en: The OpenSubsonic response did not contain %@.
zh_hant: OpenSubsonic 響應缺少 %@。

source: OpenSubsonic 服务器 URL 无效。
en: Invalid OpenSubsonic server URL.
zh_hant: OpenSubsonic 伺服器 URL 無效。

source: OpenSubsonic 服务器返回 HTTP \(status)。
en: The OpenSubsonic server returned HTTP \(status).
zh_hant: OpenSubsonic 伺服器返回 HTTP \(status)。

source: OpenSubsonic 服务器返回 HTTP %lld。
en: The OpenSubsonic server returned HTTP %lld.
zh_hant: OpenSubsonic 伺服器返回 HTTP %lld。

source: OpenSubsonic 服务器错误 \(code)：\(message)
en: OpenSubsonic server error \(code): \(message)
zh_hant: OpenSubsonic 伺服器錯誤 \(code)：\(message)

source: OpenSubsonic 服务器错误 \(error.code)：\(error.message)
en: OpenSubsonic server error \(error.code): \(error.message)
zh_hant: OpenSubsonic 伺服器錯誤 \(error.code)：\(error.message)

source: OpenSubsonic 服务器错误 %lld：%@
en: OpenSubsonic server error %lld: %@
zh_hant: OpenSubsonic 伺服器錯誤 %lld：%@

source: OpenSubsonic 配置无效：\(reason)
en: Invalid OpenSubsonic configuration: \(reason)
zh_hant: OpenSubsonic 設定無效：\(reason)

source: OpenSubsonic 配置无效：%@
en: Invalid OpenSubsonic configuration: %@
zh_hant: OpenSubsonic 設定無效：%@

source: 如果是局域网地址（\(host)），请检查 系统设置 → 隐私与安全性 → 本地网络 是否允许「Auralis」访问本地网络，并确认 Mac 与服务器在同一网络。
en: If this is a LAN address (\(host)), make sure Auralis can access the local network in System Settings → Privacy & Security → Local Network, and that your Mac and server are on the same network.
zh_hant: 若為區域網路位址（\(host)），請在「系統設定 → 隱私權與安全性 → 本機網路」允許 Auralis 存取本機網路，並確認 Mac 與伺服器位於同一網路。

source: 如果是局域网地址（\(host)），请检查 设置 → 隐私与安全 → 本地网络 是否允许「Auralis」访问本地网络，并确认设备与服务器在同一网络。
en: If this is a LAN address (\(host)), make sure Auralis can access the local network in Settings → Privacy & Security → Local Network, and that your device and server are on the same network.
zh_hant: 若為區域網路位址（\(host)），請在「設定 → 隱私權與安全性 → 本機網路」允許 Auralis 存取本機網路，並確認裝置與伺服器位於同一網路。

source: 如果是局域网地址（%@），请检查 系统设置 → 隐私与安全性 → 本地网络 是否允许「Auralis」访问本地网络，并确认 Mac 与服务器在同一网络。
en: If this is a LAN address (%@), make sure Auralis can access the local network in System Settings → Privacy & Security → Local Network, and that your Mac and server are on the same network.
zh_hant: 若為區域網路位址（%@），請在「系統設定 → 隱私權與安全性 → 本機網路」允許 Auralis 存取本機網路，並確認 Mac 與伺服器位於同一網路。

source: 如果是局域网地址（%@），请检查 设置 → 隐私与安全 → 本地网络 是否允许「Auralis」访问本地网络，并确认设备与服务器在同一网络。
en: If this is a LAN address (%@), make sure Auralis can access the local network in Settings → Privacy & Security → Local Network, and that your device and server are on the same network.
zh_hant: 若為區域網路位址（%@），請在「設定 → 隱私權與安全性 → 本機網路」允許 Auralis 存取本機網路，並確認裝置與伺服器位於同一網路。

source: 找不到主机（错误 -1003）\(hostText)。请检查服务器地址（IP / 主机名 / .local）。
en: Host not found (error -1003)\(hostText). Check the server address (IP / hostname / .local).
zh_hant: 找不到主機（錯誤 -1003）\(hostText)。請檢查伺服器位址（IP／主機名稱／.local）。

source: 找不到主机（错误 -1003）%@。请检查服务器地址（IP / 主机名 / .local）。
en: Host not found (error -1003)%@. Check the server address (IP / hostname / .local).
zh_hant: 找不到主機（錯誤 -1003）%@。請檢查伺服器位址（IP／主機名稱／.local）。

source: 无法连接到服务器（错误 -1004）\(hostText)。服务器可能未启动或拒绝连接。
en: Could not connect to the server (error -1004)\(hostText). It may be offline or refusing connections.
zh_hant: 無法連線到伺服器（錯誤 -1004）\(hostText)。伺服器可能尚未啟動或拒絕連線。

source: 无法连接到服务器（错误 -1004）%@。服务器可能未启动或拒绝连接。
en: Could not connect to the server (error -1004)%@. It may be offline or refusing connections.
zh_hant: 無法連線到伺服器（錯誤 -1004）%@。伺服器可能尚未啟動或拒絕連線。

source: 服务器未声明所需功能：\(name)
en: The server did not advertise the required capability: \(name)
zh_hant: 伺服器未宣告所需功能：\(name)

source: 服务器未声明所需功能：%@
en: The server did not advertise the required capability: %@
zh_hant: 伺服器未宣告所需功能：%@

source: 服务器返回的内容无法解析：\(detail)
en: Could not parse the server response: \(detail)
zh_hant: 無法解析伺服器返回的內容：\(detail)

source: 服务器返回的内容无法解析：%@
en: Could not parse the server response: %@
zh_hant: 無法解析伺服器返回的內容：%@

source: 网络无法连接（错误 -1009）\(hostText)。请检查网络连接。
en: Network is unavailable (error -1009)\(hostText). Check your network connection.
zh_hant: 網路無法連線（錯誤 -1009）\(hostText)。請檢查網路連線。

source: 网络无法连接（错误 -1009）%@。请检查网络连接。
en: Network is unavailable (error -1009)%@. Check your network connection.
zh_hant: 網路無法連線（錯誤 -1009）%@。請檢查網路連線。

source: 网络请求失败（错误 \(code)）\(hostText)。请检查地址和网络。
en: Network request failed (error \(code))\(hostText). Check the address and network.
zh_hant: 網路要求失敗（錯誤 \(code)）\(hostText)。請檢查位址與網路。

source: 网络请求失败（错误 %lld）%@。请检查地址和网络。
en: Network request failed (error %lld)%@. Check the address and network.
zh_hant: 網路要求失敗（錯誤 %lld）%@。請檢查位址與網路。

source: 网络连接中断（错误 -1005）\(hostText)。
en: Network connection interrupted (error -1005)\(hostText).
zh_hant: 網路連線中斷（錯誤 -1005）\(hostText)。

source: 网络连接中断（错误 -1005）%@。
en: Network connection interrupted (error -1005)%@.
zh_hant: 網路連線中斷（錯誤 -1005）%@。

source: 连接超时（错误 -1001）\(hostText)。请检查服务器地址与网络。
en: Connection timed out (error -1001)\(hostText). Check the server address and network.
zh_hant: 連線逾時（錯誤 -1001）\(hostText)。請檢查伺服器位址與網路。

source: 连接超时（错误 -1001）%@。请检查服务器地址与网络。
en: Connection timed out (error -1001)%@. Check the server address and network.
zh_hant: 連線逾時（錯誤 -1001）%@。請檢查伺服器位址與網路。
